#+title: Release Notes for Sprint 27
#+options: date:nil toc:nil author:nil num:nil
#+todo: ANALYSIS IMPLEMENTATION TESTING | COMPLETED CANCELLED
#+tags: story(s) epic(e) task(t) note(n) spike(p)

* Release Notes

This file contains all stories that were closed during sprint 27.

** Development Stories Implemented

#+begin: clocktable :maxlevel 3 :scope subtree
Clock summary at [2013-05-22 Wed 22:56]

| Headline                                           | Time   |      |      |
|----------------------------------------------------+--------+------+------|
| *Total time*                                       | *8:35* |      |      |
|----------------------------------------------------+--------+------+------|
| Development Stories Implemented                    |        | 8:35 |      |
| IMPLEMENTATION Clean up the SML to C++ transformer |        |      | 8:35 |
#+end:

*** IMPLEMENTATION Clean up the SML to C++ transformer                :spike:

Continuing from previous iteration, see description in Sprint 26.

**** IMPLEMENTATION Create =file_info_factory=
     CLOCK: [2013-05-22 Wed 18:27]--[2013-05-22 Wed 18:52] =>  0:25
     CLOCK: [2013-05-22 Wed 18:24]--[2013-05-22 Wed 18:27] =>  0:03
     CLOCK: [2013-05-22 Wed 18:09]--[2013-05-22 Wed 18:18] =>  0:09
     CLOCK: [2013-05-22 Wed 08:29]--[2013-05-22 Wed 08:40] =>  0:11
     CLOCK: [2013-05-22 Wed 07:54]--[2013-05-22 Wed 08:18] =>  0:24
     CLOCK: [2013-05-21 Tue 23:41]--[2013-05-21 Tue 23:53] =>  0:12
     CLOCK: [2013-05-21 Tue 23:22]--[2013-05-21 Tue 23:41] =>  0:19
     CLOCK: [2013-05-21 Tue 22:30]--[2013-05-21 Tue 23:22] =>  0:52
     CLOCK: [2013-05-21 Tue 18:10]--[2013-05-21 Tue 18:42] =>  0:32
     CLOCK: [2013-05-21 Tue 17:57]--[2013-05-21 Tue 18:04] =>  0:07
     CLOCK: [2013-05-21 Tue 08:30]--[2013-05-21 Tue 08:32] =>  0:02
     CLOCK: [2013-05-21 Tue 08:23]--[2013-05-21 Tue 08:26] =>  0:08
     CLOCK: [2013-05-21 Tue 07:56]--[2013-05-21 Tue 08:15] =>  0:19
     CLOCK: [2013-05-20 Mon 23:10]--[2013-05-20 Mon 23:20] =>  0:10
     CLOCK: [2013-05-20 Mon 22:54]--[2013-05-20 Mon 23:10] =>  0:16
     CLOCK: [2013-05-20 Mon 22:42]--[2013-05-20 Mon 22:54] =>  0:12
     CLOCK: [2013-05-20 Mon 22:22]--[2013-05-20 Mon 22:41] =>  0:19
     CLOCK: [2013-05-20 Mon 22:08]--[2013-05-20 Mon 22:21] =>  0:13
     CLOCK: [2013-05-20 Mon 21:24]--[2013-05-20 Mon 22:06] =>  0:42
     CLOCK: [2013-05-20 Mon 18:07]--[2013-05-20 Mon 18:42] =>  0:35
     CLOCK: [2013-05-20 Mon 18:01]--[2013-05-20 Mon 18:05] =>  0:04
     CLOCK: [2013-05-20 Mon 17:46]--[2013-05-20 Mon 17:53] =>  0:07
     CLOCK: [2013-05-20 Mon 08:29]--[2013-05-20 Mon 08:37] =>  0:08
     CLOCK: [2013-05-20 Mon 08:26]--[2013-05-20 Mon 08:28] =>  0:02
     CLOCK: [2013-05-20 Mon 07:53]--[2013-05-20 Mon 08:15] =>  0:22
     CLOCK: [2013-05-19 Sun 22:53]--[2013-05-20 Mon 00:04] =>  1:11

**** IMPLEMENTATION Plug =file_info_factory= into workflow
     CLOCK: [2013-05-22 Wed 22:20]--[2013-05-22 Wed 22:56] =>  0:36

*** IMPLEMENTATION Move services into their own type                  :story:

Continuing from previous iteration, see description in Sprint 26.

**** IMPLEMENTATION Move all of the existing pod code to use new type

*** IMPLEMENTATION Use explicit casting for versioned to unversioned conversions :story:

Continuing from previous iteration, see description in Sprint 26.

*** IMPLEMENTATION Add =extract_key= function                         :story:

Continuing from previous iteration, see description in Sprint 26.

** Deprecated Development Stories
